# Напишите функцию get_total, которая принимает на вход число единиц товара и стоимость каждой единицы.
# Функция возвращает одно число — общую стоимость данного числа товаров.
def get_total(units, price):
    # Вместо pass напишите тело функции
    return units * price


print(get_total(50, 12))
