# Напишите lambda-функцию area, которая принимает на вход два числа — стороны
# прямоугольника — через запятую и возвращает площадь прямоугольника.
#
# Пример:
#
# print(area(12,5))
# # 60


area = lambda x, y: x * y
print(area(12, 5))
